<!DOCTYPE html>
<html lang="fr">
	<head>
		<title>Malearin Web Site</title>
		<!-- Information de la page-->
		<meta charset="utf-8" />
		<meta name="author" content="Timoth&eacute;e Varin & Corentin Vaillant" />
		<meta name="keywords" content="DeepBlue, DeepMind, échecs, Jeu de Go, AlphaGo, Deep learning, IA, intelligence artificiel, algorithmes" />
		<!-- Police d'ecriture Google-->
		<link rel="preconnect" href="https://fonts.googleapis.com">
		<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
		<link href="https://fonts.googleapis.com/css2?family=Roboto&display=swap" rel="stylesheet">
		<!-- Feuilles de styles CSS -->
		<link href="../css/mainstyle.css" rel="stylesheet">
		<link href="../css/page2.css" rel="stylesheet">
	</head>
	<body>
		<header>
			<div class="title">
				<h1>The Malearin WebSite</h1>
			</div>
				<p><span class="subtitle">Le site internet parlant de l'intelligence artificielle et de l'apprentissage automatique</span></p>
			<nav>
				<a href="index.html">Home</a>
				<a href="page1.html"  class="header-link">DLSS et FidelityFx</a>
				<a class="header-link">DeepMind et DeepBlue</a>
				<a href="page3.html"  class="header-link">Le fonctionnement</a>
			</nav>
		<hr/>
		</header>
		<section class="realbody">
			<br/>
			<h2>L'intelligence artificielle dans le domaine des jeux de soci&eacute;t&eacute;</h2>
			<h4>Depuis le d&eacute;but des ann&eacute;es 1990, l'ordinateur se d&eacute;veloppe d'une vitesse tr&egrave;s impressionnante. IBM d&eacute;veloppe une intelligence artificielle nomm&eacute;e "Deep Blue".</h4>
			<h4>Une intelligence artificielle capable de battre les meilleurs joueurs d'&eacute;checs.</br> Il arrivera &agrave; battre le c&eacute;l&egrave;bre champion du monde d'&eacute;chec "Garry Kasparov" en 1997 lors d'une revanche.</br>Cela d&eacute;montre que l'intelligence des machines d&eacute;passe d&eacute;sormais ceux des hommes.</h4>
			<img src="../img/DeepBlue.jpg" class="ilustrations" style="width:20%"/>
			<figcaption>Photo de l'apparence du superordinateur qui a battu le champion du monde d'&eacute;chec</figcaption>
			<h4>Une dizaine d'ann&eacute;es plus tard, Google avec sa filiale nomm&eacute; "DeepMind" ont cr&eacute;&eacute;, eux aussi, une intelligence artificielle qui s'appelle "AlphaGo".</br>Cette fois-ci, l'ordinateur va s'attaquer au "<a href="https://fr.wikipedia.org/wiki/Go_(jeu)" style="color:white">jeu de Go</a>".</h4>
			<h4>Cependant, cette tâche s'annonce plus difficile qu'avec le jeu d'&eacute;checs.<br>En effet, le jeu d'&eacute;checs pr&eacute;sente beaucoup moins de possibilit&eacute;s de mouvements que le jeu de Go.</br>Mais en octobre 2015, il a gagn&eacute; 5 partie sur 5 contre le champion d'Europe <a href="https://fr.wikipedia.org/wiki/Fan_Hui" style="color:white">Fan Hui</a>.</br>Et en mars 2016, il arriva &agrave; remporter 4 victoires sur 5 contre le champion du monde <a href="https://fr.wikipedia.org/wiki/Lee_Sedol" style="color:white">Lee Sedol</a> (D&eacute;sign&eacute; champion du monde entre 2000-2010).</h4>
			<img src="../img/MatchAlphaGo.jpg" class="ilustrations" />
			<figcaption>Photo issu du match entre AlphaGo et Lee Sedol</figcaption>
			<h4>Un an apr&egrave;s la victoire d'AlphaGo contre Lee Sedol, DeepMind a d&eacute;velopp&eacute; une version am&eacute;lior&eacute;e d'AlphaGO nomm&eacute;e "AlphaGo Zero".<br>Cette version m&eacute;rite qu'ont s'y attarde car elle a une conception assez originale.</h4>
			<h4>En effet, contrairement &agrave; AlphaGo qui fonctionnait avec les connaissances des humains, AlphaGo Zero a d&eacute;marr&eacute; uniquement avec le visuel du plateau ainsi qu'avec les r&egrave;gles.</br>Ayant ces informations, elle a effectu&eacute; des millions de parties contre elle-même. Ainsi, elle a pu comprendre les m&eacute;caniques du jeu et d&eacute;couvrir de nouvelle ouverture du jeu de Go</br></h4>
			<h4>Donc en 3 jours, AlphaGo Z&eacute;ro a pu vaincre la premi&egrave;re version d'AlphaGo durant 100 parties o&ugrave; elle a obtenu 60 victoires.<br>Tout cela d&eacute;montre que les intelligences artificielles peuvent maintenant r&eacute;fl&eacute;chir par eux-mêmes et que maintenant elle nous d&eacute;passe de tr&egrave;s loin.</h4>
			<br/>
		</section>
		<section class="sources">
			<h4>Sources :</h4>
			<a href="https://fr.wikipedia.org/wiki/DeepMind" class="sources-link">DeepMind (Wikip&eacute;dia)</a><a href="https://fr.wikipedia.org/wiki/Deep_Blue" class="sources-link">DeepBlue Wikip&eacute;dia)</a> <a href="https://www.ibm.com/ibm/history/ibm100/us/en/icons/deepblue/" class="sources-link">IBM DeepBlue</a> <a class="sources-link" href="https://deepmind.com/">DeepMind</a>
		</section>
		<footer>
			<p> &copy; Parzival Developer Team</p>
		</footer>
	</body>
</html>